package 欢乐颂._10经典问题;

/**
 * 问题:水平面上有 N 座大楼，每座大楼都是矩阵的形状，可以用一个三元组表示 (start, end, height)，分别代表其在x轴上的起点，终点和高度。
 * 	       大楼之间从远处看可能会重叠，求出 N 座大楼的外轮廓线。
 * 	       外轮廓线的表示方法为若干三元组，每个三元组包含三个数字 (start, end, height)，代表这段轮廓的起始位置，终止位置和高度。
 * 例如:输入:
		[   [1, 3, 3],
		    [2, 4, 4],
		    [5, 6, 1]  ]
		输出:
		[   [1, 2, 3],
		    [2, 4, 4],
		    [5, 6, 1]  ]

 * @author Administrator
 *
 */
public class _01大楼轮廓_搜索二叉树问题 {
	    public static void main(String[] args) {
	    	
	    }
}
